import { MutableRefObject, ReactNode, useEffect, useRef, useState } from "react";
import { Question } from "./Question";
import { Reorder } from "./types";

type LoadImageArgs = {
  src: string;
};

const loadImage = async ({ src }: LoadImageArgs) => {
  const path = `./images/test2${src}.png`;
  const image = await import(/* @vite-ignore */ path);
  return image.default;
};

type GetAppropriateLetterArgs = {
  index: number;
};

const getAppropriateLetter = ({ index }: GetAppropriateLetterArgs) => {
  return String.fromCharCode(96 + index);
};

const length = 20;

export const TestAnswersShuffler = () => {
  const [questions, setQuestions] = useState<{ question: ReactNode; options: ReactNode[] }[]>([]);

  useEffect(() => {
    const arrangeQuestions = async () => {
      const questions = await Promise.all(
        Array.from({ length }).map(async (_, index) => {
          const questionNumber = index + 1;
          const imgsrc = `/question${questionNumber}`;
          const image = await loadImage({ src: imgsrc });
          return {
            question: <img src={image} />,
            options: await Promise.all(
              Array.from({ length: 5 }).map(async (_, index) => {
                const optionNumber = index + 1;
                const letter = getAppropriateLetter({ index: optionNumber });
                const optionimgsrc = `${imgsrc}${letter}`;
                const image = await loadImage({ src: optionimgsrc });
                return <img src={image} />;
              }),
            ),
          };
        }),
      );

      setQuestions(questions);
    };

    arrangeQuestions();
  }, []);

  //     {
  //       question: <img src={question1} />,
  //       options: [
  //         <img src={question1a} />,
  //         <img src={question1b} />,
  //         <img src={question1c} />,
  //         <img src={question1d} />,
  //       ],
  //     },
  //     {
  //         question: <img src={question2} />,
  //         options: [
  //           <img src={question2a} />,
  //           <img src={question2b} />,
  //           <img src={question2c} />,
  //           <img src={question2d} />,
  //         ],
  //       },
  //     {
  //       question: "מהו ההבדל העיקרי בין וירוס (Virus) לתולעת (Warm)",
  //       options: [
  //         "וירוס דורש הפעלה של קובץ או תוכנה נגועים, בעוד שהתולעת מפיצה את עצמה בצורה עצמאית.",
  //         "וירוס תוקף בעיקר את הרשתות הפנימיות של החברה, בעוד שהתולעת תוקפת את הרשתות החיצונית של החברה.",
  //         "וירוס תוקף באופן ממוקד את מערכות המחשב, בעוד שהתולעת תקופת את הרשת.",
  //         "כל התשובות נכונות.",
  //       ],
  //     },
  //     {
  //       question: "מהו תפקידו של Dropper בעת תקיפת רשת ארגונית",
  //       options: [
  //         "תכנת Dropper איננה גורמת נזק באופן ישיר למערכת, אלא הפעלת Dropper גורמת להורדת והתקנת תכנה זדונית, אשר מאפשרת יצירת שליטה וקשר עם התוקף ואת ההשתלטות מרחוק על המערכת (C&C).",
  //         "תכנת Dropper איננה גורמת נזק באופן ישיר למערכת, אלא הפעלת Dropper במסגרת תקיפת ransomware גורמת להצפנת דיסק זיכרון של המחשב הנתקף.",
  //         "תכנת Dropper גורמת נזק באופן ישיר למערכת, באמצעות שיבוש הפעילות התקינה של המערכת, והאטת משאבי המערכת.",
  //         "תכנת Dropper גורמת נזק באופן ישיר למערכת, באמצעות שיבוש הפעילות התקינה של הרשת, והאטת משאבי הרשת.",
  //       ],
  //     },
  //     {
  //       question: (
  //         <div>
  //           <div>
  //             לפניכם סרטוט המתאר טופולגיה שבה שני רכיבים ברשת תקינה (A ו-B) מקיימים שיח באופן תדיר.
  //           </div>
  //           <div>רכיב X הנו רכיב זדוני.</div>
  //           <img src={five} />
  //         </div>
  //       ),
  //       options: [
  //         "זוהי תקיפה אקטיבית, המבוססת על התחזות של התוקף לרכיב רשת תקין ושליחת מסרים מפוברקים שעושיים להכיל תוכן זדוני.",
  //         "זוהי תקיפה פאסיבית, המבוססת על התחזות של התוקף לרכיב רשת תקין ושליחת מסרים מפוברקים שעשויים להכיל תוכן זדוני.",
  //         "זוהי תקיפה אקטיבית המבוססת על השתלטות על סשן (Session) בין רכיב A ורכיב B ושליחת מסרים מפוברקים שעשויים להכיל תוכן זדוני.",
  //         "זוהי תקיפה פאסיבית, המבוססת על השתלטות על סשן (Session) בין רכיב A ורכיב B ושליחת מסרים מפוברקים שעשויים להכיל תוכן זדוני.",
  //       ],
  //     },
  //     {
  //       question:
  //         'ארבעה איומים מרכזיים הם הונאה (Deception), גילוי (Unauthorized Disclosure), תפיסה בכוח (Usurpation) ושיבוש (Distruption). בחרו את סוגי התקיפה אשר מאפיינים את האיום "שיבוש"',
  //       options: [
  //         "שלילת יכולת, השחתה, חסימה.",
  //         "חשיפה, יירוט, הסקה.",
  //         "התחזות, זיוף, דחייה.",
  //         "ניכוס פסול, שימוש לרעה.",
  //       ],
  //     },
  //     {
  //       question: (
  //         <div>
  //           <div>לפניכם תרחיש תקיפה. בחרו בתשובה המתאימה ביותר אשר מתארת את התקיפה</div>
  //           <img src={seven} />
  //         </div>
  //       ),
  //       options: [
  //         "התרחיש מציג תקיפה שמטרתה חשיפת המידע לתוקף.",
  //         "התרחיש מציג תקיפה שמטרתה הצפנת המידע על ידי התוקף.",
  //         "התרחיש מציג תקיפה שמטרתה זיוף המידע על ידי התוקף.",
  //         "התרחיש מציג תקיפה שמטרתה שיבוש המידע על ידי התוקף.",
  //       ],
  //     },
  //     {
  //       question: (
  //         <div>
  //           <div>
  //             לפניכם תרחיש תקיפה. משתמשי Alice ו-Bob מקיימים קשר דיגיטלי לגיטימי, בעוד שDarth הנו תוקף
  //             סייבר.
  //           </div>
  //           <div>בחרו בתשובה המתאימה ביותר אשר מתארת את התקיפה</div>
  //           <img src={eight} />
  //         </div>
  //       ),
  //       options: [
  //         "התרחיש מציג תקיפה פאסיבית, שמטרתה של Darth ליירט מסרים העוברים בין Alice ו- Bob.",
  //         "התרחיש מציג תקיפה אקטיבית, שמטרתה של Darth ליירט מסרים העוברים בין Alice ו-Bob.",
  //         "התרחיש מציג תקיפה אקטיבית, שמטרתה של Darth לשבש מסרים העוברים בין Alice ו-Bob.",
  //         "התרחיש מציג תקיפה פאסיבית, שמטרתה של Darth לשבש מסרים העוברים בין Alice ו-Bob.",
  //       ],
  //     },
  //     {
  //       question:
  //         "ארגון פיננסי מקיים דיון בתחום הסייבר שבמהלכו הנהלת מרכז ניטור הסייבר בארגון מתלוננת על מערכת IDS שהחברה רכשה, בטענה שרוב ההתראות של המערכת הן התראות שווא ואינן מצבעיות על האיום האמיתי. סביר להניח כי מנהלת מרכז ניטור הסייבר תאמר:",
  //       options: [
  //         "המערכת IDS מתריעה כל היום על False positive, ולכן מקשה מאוד על צוות ניטור הסייבר להתמקד בתחקור אירועי סייבר אמיתיים.",
  //         "המערכת IDS מתריעה כל היום על False negative, ולכן מקשה מאוד על צוות ניטור הסייבר להתמקד בתחקור אירועי סייבר אמיתיים.",
  //         "המערכת IDS מתריעה כל היום על True negative, ולכן מקשה מאוד על צוות ניטור הסייבר להתמקד בתחקור אירועי סייבר אמיתיים.",
  //         "המערכת IDS מתריעה כל היום על True positive, ולכן מקשה מאוד על צוות ניטור הסייבר להתמקד בתחקור אירועי סייבר אמיתיים.",
  //       ],
  //     },
  //     {
  //       question:
  //         "כמענה לתופעת התראות שווא, המשתתפים בדיון הציגו שיפורים הדרושים עבור מערכת IDS על מנת לצמצם בכמויות אירועי שווא. בחרו בתשובה המתאימה ביותר, שביכולתה לצמצם באופן משמעותי את הכמויות של התראות השווא.",
  //       options: [
  //         "להפעיל את המערכת IDS על בסיס מודול שמבוסס חתימות (Knowledge-based IDS) בלבד, ולכבות מודול שמבוסס על זיהוי התנהגותי (Behavior-based IDS).",
  //         "להפעיל את המערכת IDS על בסיס מודול שמבוסס על זיהויה התנהגותי (Behavior-based IDS) בלבד, ולכבות מודול שמבוסס חתימות (Knowledge-based IDS).",
  //         "להפעיל את המערכת IDS על בסיס מודול שמבוסס חתימות (Knowledge-based IDS), תוך הפעלת יכולת לזיהוי אנומליות.",
  //         "להפעיל את המערכת IDS על בסיס מודול שמבוסס על זיהוי התנהגותי (Behavior-based IDS), תוך הפעלת יכולת לזיהוי אנומליות.",
  //       ],
  //     },
  //     {
  //       question:
  //         "במהלך הדיון עלה כי הווריאנט של הנוזקה הידועה והמוכרת מזו שנה בעולם תקפה את הארגון, הנוזקה חדרה לרשת מחשוב ארגונית וגרמה לנזק. בתחקיר עלה כי ספק IDS שחרר עדכון רלוונטי חצי שנה לפני תאריך הפגיעה של הנוזקה ברשת הארגונית, והארגון אכן התקין את העדכון באופן מיידי. על אף התקנת העדכון, ההתראה על נוזקה שנוצרה במערכת IDS לא הגיעה לטיפול של צוות ניטור סייבר בארגון. משתתפי הדיון נתבקשו להעביר המלצות לשיפור רמת הדיוק של מערך הניטור. ידוע כי שלושה משתתפים בדיון העבירו המלצות לא נכונות שאנן יכולות להתרחש בפעול. בחרו בתשובה אשר מייצגת את ההמלצה הנכונה.",
  //       options: [
  //         "הווריאנט של הנוזקה סווג על ידי מערכת IDS לרמת סיכון 8, בעוד שההתראות שעולות לצוות הניטור הן מסיווג 12 ומעלה. לאור זאת, ממליץ להעביר את כלל ההתראות מרמת סיכון 8 ומעלה לבחינת צוות הניטור.",
  //         "ממליץ לחבר את מערכת ה-IDS למכונת חומת האש בפרימטר הגנתי, על מנת לאפשר הגנה כפולה על הרשת. במידה וה-IDS יפספס את הנוזקה, מכונת חומת האש בפרימטר הגנתי תוכל לאתר את הנוזקה במעגל השני.",
  //         "ממליץ לחבר את מערכת הIDS למכונת חומת האש בפרימטר הגנתי, על מנת לאפשר הגנה כפולה על הרשת. במידה ומכונת חומת האש בפרימטר הגנתי תפספס את הנוזקה, מערכת IDS תוכל לאתר את הנוזקה במעגל השני.",
  //         "תשובות ב' וג' אפשריות.",
  //       ],
  //     },
  //   ];

  const refs = useRef<Array<MutableRefObject<Reorder | null>>>(
    Array.from({ length }).map(() => ({ current: null })),
  );

  return (
    <div style={{ display: "grid", gap: "8px" }}>
      {questions.map((question, index) => {
        return (
          <Question key={index} index={index + 1} callbackRef={refs.current[index]} {...question} />
        );
      })}
      <button
        onClick={() => {
          refs.current.forEach((ref) => ref.current?.());
        }}
      >
        Reshuffle
      </button>
    </div>
  );
};
